import {Component} from '@angular/core';

@Component({
    selector: 'app-root',
    templateUrl: './app.component.html',
    styleUrls: ['./app.component.css']
})
export class AppComponent {
    data = [
        {
            src: '../assets/images/webdesign10-11.jpg', title: 'طراحی و تو سعه',
            link: 'http://google.com',
            text: ' شرکت ما  مدت زمان طولانی درزمینه طراحی' +
            ' و بهینه سازی و سئوی سایت فعالیت دارد' +
            ' که بطورمداوم دراین خصوص بصورت حرفه ای و تخصصی فعال است و هم اکنون با همکاری' +
            ' و پشتوانه پرسنل ماهر، با قدرتی بیش از پیش در خدمت طراحی سایت در تمام  ایران می باشد.\n'
        },
        {
            src: '../assets/images/webdesign6-6.jpg', title: 'سئو و بهینه سازی',
            link: 'http://google.com',
            text: ' شرکت ما  مدت زمان طولانی درزمینه طراحی' +
            ' و بهینه سازی و سئوی سایت فعالیت دارد' +
            ' که بطورمداوم دراین خصوص بصورت حرفه ای و تخصصی فعال است و هم اکنون با همکاری' +
            ' و پشتوانه پرسنل ماهر، با قدرتی بیش از پیش در خدمت طراحی سایت در تمام  ایران می باشد.\n'
        }, {
            src: '../assets/images/webdesign8-8.jpg', title: 'سرویس هاست و دامنه',
            link: 'http://google.com',
            text: ' شرکت ما  مدت زمان طولانی درزمینه طراحی' +
            ' و بهینه سازی و سئوی سایت فعالیت دارد' +
            ' که بطورمداوم دراین خصوص بصورت حرفه ای و تخصصی فعال است و هم اکنون با همکاری' +
            ' و پشتوانه پرسنل ماهر، با قدرتی بیش از پیش در خدمت طراحی سایت در تمام  ایران می باشد.\n'
        }, {
            src: '../assets/images/app-1.jpg', title: 'سئو و بهینه سازی',
            link: 'http://google.com',
            text: 'کد نویسی نرم افزارهای گوشی همراه (موبایل) یکی ' +
            'ازپیشرفت های جدید و مناسب برای تجارت و افزایش خدمات بیشتر به مخاطبان و حفظ آنان  و' +
            ' پیشرفت دربین رقیبان خواهد بود. موبایل های هوشمند همیشه' +
          '  جزو موارد موثر در تصمیم گیری برای سفارش طراحی اپلیکیشن است.'
        },
    ];
    title = 'testproject';
}
